{
  "url": "https://timesofindia.indiatimes.com/home/headlines",
  "total_headlines": 5,
  "overall_summary": "F-1 visa hold leaves Indian student in limbo; passport stuck; here's what happened. Schools in Nuh district of Haryana closed today: Here's why 'Govt plotted jailbreak' Jitendra Singh slams Farooq Punjab jailbreak: 1 killed.",
  "individual_summaries": [
    {
      "headline": "F-1 visa hold leaves Indian student in limbo; passport stuck; here's what happened",
      "summary": "Indian student Dhanashree Rajesh Gaidhani recounted the rather surreal turn her US F-1 visa interview took at the American Embassy in New Delhi. A consular officer flagged her Reddit account, not for its content, but simply because it wasn't listed on her DS-160 form and was supposedly set to private. The twist? The account was public all along, and free of anything even remotely controversial.",
      "link": "https://timesofindia.indiatimes.com/education/news/this-indian-students-f-1-visa-was-delayed-and-her-passport-retained-thanks-to-her-reddit-account-do-you-know-why/articleshow/122430379.cms"
    },
    {
      "headline": "Schools in Nuh district of Haryana closed today: Here's why",
      "summary": "All educational institutions in Haryana's Nuh district ordered shut on Monday. The order comes alongside a 24-hour suspension of mobile internet and bulk SMS services. The move is aimed at averting a repeat of last year’s communal violence.",
      "link": "https://timesofindia.indiatimes.com/education/news/schools-in-nuh-district-of-haryana-closed-today-heres-why/articleshow/122430064.cms"
    },
    {
      "headline": "'Govt plotted jailbreak'",
      "summary": "Punjab govt plotted Nabha jailbreak, alleges Amarinder Singh. Election Result CoverageLebanon Rocket AttackKim JongAR RahmanHezbollah Weapon.",
      "link": "https://timesofindia.indiatimes.com/videos/news/punjab-govt-plotted-nabha-jailbreak-alleges-amarinder-singh/videoshow/55649797.cms"
    },
    {
      "headline": "Jitendra Singh slams Farooq",
      "summary": "Jitendra Singh slams Farooq Abdullah over his controversial remarks on PoKTrendingElection Result CoverageLebanon Rocket AttackKim JongAR RahmanHezbollah Weapon.",
      "link": "https://timesofindia.indiatimes.com/videos/news/jitendra-singh-slams-farooq-abdullah-over-his-controversial-remarks-on-pok/videoshow/55649791.cms"
    },
    {
      "headline": "Punjab jailbreak: 1 killed",
      "summary": "A 24-year old woman, Reena, was killed in Samrala, Punjab, when police opened fire at a vehicle which jumped a security barricade. Police in the state are on high alert after six inmates of Nabha jail - including dreaded Khalistan Liberation Force chief Harminder Mintoo.",
      "link": "https://timesofindia.indiatimes.com/videos/news/punjab-jailbreak-woman-killed-after-police-open-fire-at-vehicle-that-jumped-security-barricade/videoshow/55650435.cms"
    }
  ],
  "raw_data_file": "data/headlines_20250714_125116.json"
}