{
  "url": "https://timesofindia.indiatimes.com/home/headlines",
  "total_headlines": 4,
  "overall_summary": "Jitendra Singh slams Farooq Punjab jailbreak: 1 killed Gold loot caught on CCTV. \"Govt plotted jailbreak,\" says Singh. \"I will not let Punjab go to jail again,\" he adds. \"We will not allow Punjab to go back to jail,\" Singh adds.",
  "individual_summaries": [
    {
      "headline": "'Govt plotted jailbreak'",
      "summary": "Punjab govt plotted Nabha jailbreak, alleges Amarinder Singh. Election Result CoverageLebanon Rocket AttackKim JongAR RahmanHezbollah Weapon.",
      "link": "https://timesofindia.indiatimes.com/videos/news/punjab-govt-plotted-nabha-jailbreak-alleges-amarinder-singh/videoshow/55649797.cms"
    },
    {
      "headline": "Jitendra Singh slams Farooq",
      "summary": "Jitendra Singh slams Farooq Abdullah over his controversial remarks on PoKTrendingElection Result CoverageLebanon Rocket AttackKim JongAR RahmanHezbollah Weapon.",
      "link": "https://timesofindia.indiatimes.com/videos/news/jitendra-singh-slams-farooq-abdullah-over-his-controversial-remarks-on-pok/videoshow/55649791.cms"
    },
    {
      "headline": "Punjab jailbreak: 1 killed",
      "summary": "A 24-year old woman, Reena, was killed in Samrala, Punjab, when police opened fire at a vehicle which jumped a security barricade. Police in the state are on high alert after six inmates of Nabha jail - including dreaded Khalistan Liberation Force chief Harminder Mintoo.",
      "link": "https://timesofindia.indiatimes.com/videos/news/punjab-jailbreak-woman-killed-after-police-open-fire-at-vehicle-that-jumped-security-barricade/videoshow/55650435.cms"
    },
    {
      "headline": "Gold loot caught on CCTV",
      "summary": "Caught on CCTV: Unidentified men loot gold bars worth Rs 4 cr in Ahmedabad. Gold bars weighing 14 kilograms worth Rs4 crore were allegedly looted from the office of a cash logistics company. Sign InTOIindiatop videostrendingentertainmentTOI originalsinternationalFormula Esportshealthtvfoodregional  NewsVideos Newsindia News",
      "link": "https://timesofindia.indiatimes.com/videos/news/caught-on-cctv-unidentified-men-loot-gold-bars-worth-rs-4-cr-in-ahmedabad/videoshow/55636206.cms"
    }
  ],
  "raw_data_file": "data/headlines_20250711_111834.json"
}